{
"title": "Introduction",
"description": "Hi folks! This is HackED's official **HitchHacker's Guide To The Galaxy**. Contained in this channel is everything you'll need to get the most out of your hackathon experience, as well as the answers to a lot of questions you might have throughout the hackathon; it's a reference for safety information, the event schedule, project guidelines, submission instructions, and more.

Please use the search function or the links provided to navigate the Guide (and, if you have any questions that aren't answered, ask us in <#1187244568538787922>!",
"color": 62441,
"thumbnail": {
  "url": "https://hacked.compeclub.com/static/media/HackedCircle.609e5186df6e9e190993.png"
}
}

{
"title": "`Health & Safety Information`",
"description": "- HackED has absolutely zero tolerance for sexual harassment or misconduct. Any form of this behaviour could result in expulsion from the event and a follow-up with the Office of the Dean.
- HackED has absolutely zero tolerance for violence or threats to other participants.
### `Transit`
- For your safety, participants are **strongly discouraged from leaving the event in the middle of the night**.
- Edmonton public transit routes stop running at some point during the night. If you do plan to take transit home late at night, please **make sure your route is still running**. More information about exact times for individual routes can be found [here](https://www.edmonton.ca/sites/default/files/public-files/assets/transit/ETS-Route-Frequency-Table-Sept-2023.pdf).
- The University of Alberta's Safewalk program will not be running during the event, as it is a weekend.
- For a safe ride home, dial #TAXI on your cell phone.
### `Food & Drink`
- HackED aims to promote healthy work habits and environments. We ask participants to **prioritize their own mental and physical health** as much as possible, above hackathon participation or projects.
- Staying well-fed and hydrated are important! Please take time to eat and drink water throughout the event. 
  - We will provide **snacks** throughout the event and **dinner** on Saturday.
  - There is a water fountain available at our in-person location on DICE 8F. 
  - Participants are also encouraged to bring what they need to eat for as long as they plan to stay on-campus.",
"color": 62441
}

{
"title": "`Leaving & Reentering The Building`",
"description": "- If you leave and reenter the building, **you must sign out and back in at the front desk.**
- Elevators in this building require a key-pass after hours. If you get stuck downstairs and aren't able to use the elevators, send a message in <#1187246576427618354> and a volunteer will let you in.
- It is possible to get locked in the stairwell near the water fountain. If that happens, send a message in <#1187246576427618354> and a volunteer will let you in.",
"color": 62441
}

{
"title": "`Housekeeping`",
"description": "- Keep the area clean!
- There are washrooms near the front desk.
- A map of gender-neutral washrooms on campus can be found [here](https://www.ualberta.ca/maps.html?l=53.52805170773808,-113.52846739613842&z=18&campus=north_campus&c=All-Gender%20Washrooms). There are several on the first and second floors of the building.",
"color": 62441
}

{
"title": "`Workshops`",
"description": "Throughout HackED we will be hosting a variety of awesome workshops where you can learn new skills that might be helpful for your project (and for career development and personal projects outside the hackathon!) The workshops will be run by our sponsor representatives and industry professionals.

You can check out the workshop schedule in the Events of this Discord server, or in <#1190147968712573079>. Announcements and information about each workshop (e.g. where to find it) will be sent out shortly before each workshop!",
"color": 62441
}

{
"title": "`Team Creation Details`",
"description": "To create a team, run the </team:1192189267867336745> command in <#1187246388623454238>. See the pinned message in <#1187246388623454238> for more details. 

- Teams may have anywhere from 1 to 5 people (inclusive), and may consist of any combination of in-person and virtual participants.
- The team you create on Discord is our official record of your team's participants and is what we will use for prize distribution.
- If you want to add/remove someone to/from your team, please ping <@366769320275083276>.",
"color": 62441
}

{
"title": "`GitHub & DevPost Details`",
"description": "Your GitHub and DevPost links **must** be submitted using the </judging_signup:> command **before the hacking end time** as per the instructions in the [Judging Signup Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362788745445436).

Requirements:
1. Push all the code for your project to a **public** GitHub repository.
  - If you aren't familiar with GitHub, we encourage you to attend our Git workshop or to ask a mentor for help!
  - We recommend you have your repository set up early on, you *really* don't want to have last-minute Git troubles right before the Hacking End Time.
2. Make a submission to [the HackED 2024 DevPost](https://hacked-2024.devpost.com/) **including your GitHub link** (there will be a field on the DevPost page for your GitHub repository). For more information check out the [DevPost walkthrough](https://docs.google.com/document/d/14FajozLPYXjOaBhFN2CGat7VCrmkhy2093cHhvxTOUo/edit?usp=sharing).
3. Run the </judging_signup:> command to submit your judging medium preference, GitHub, DevPost, and challenge selection as per the instructions in the [Judging Signup Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362788745445436).

If any of the following conditions *are met*, **your submission will not be considered**:
- If your GitHub repository link does not link to a **public** GitHub repository with your project code.
- If your GitHub repository is updated (i.e. more commits are made to the repository) after the Hacking End Time.
- If your DevPost link does not link to a proper project page created on our DevPost; not just a DevPost project, but a project submitted **to** [the HackED 2024 DevPost](https://hacked-2024.devpost.com/).
- If your DevPost submission does not contain your GitHub repository link.
- If any team member has not signed and sent us their waiver.",
"color": 62441
}

{
"title": "`Judging Signup Details`",
"description": "### `The /judging_signup Command`
To sign up for judging, run the </judging_signup:> command in **your team text channel**. This command must be run **before the Hacking End Time**. If your team does not run this command, you *will not* be signed up for judging and will not be eligible for *any* prizes.

**First**, you must declare a medium preference using the `medium_pref` argument.
- This may be either `online` or `in-person`. We will *try* to put you in a judging room with judges who are also online/in-person for the best experience (but there is no guarantee).
- Regardless of which judges you are put with, *both online and in-person teams will be able to present*. The medium preference is only a preference; both online and in-person judges are able to judge online and in-person teams.

**Second**, you must submit links to your Github repository and DevPost project using the `github_link` and `devpost_link` arguments.
- You may at first submit an empty/template Github and DevPost.
- However, the links you submit **must be updated with your actual project code and information before the Hacking End Time**. We will use these links as our official record of your project.
- See the [Project Submission Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362760920449095) for more information on requirements for the Github and DevPost.

**Third**, you may select your challenge/s using the `challenge1` and `challenge2` arguments.
- You will implicitly be signed up for the main HackED competition, regardless of whether you specify any challenges.
- **In general, teams may select only 1 challenge**.
- A special case is when you are signing up for both one of the MecSimCalc challenges and one of the Engineering Department challenges, in which case you may select 2 challenges.
### `More Information`
**To withdraw from judging**, run </judging_withdraw:> in your team text channel. If you withdraw from judging you will no longer be eligible for any prizes and you will not need to present your project to judges.",
"color": 62441
}

{
"title": "`Directory`",
"description": "Welcome to the HitchHacker's Guide To The Galaxy! This is the bottom of the channel; use the following links or Discord's search function to navigate to the information you're looking for.

- [Introduction](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362528929304607)
- [Health & Safety Information](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362595199291472)
- [Leaving & Reentering The Building](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362626165846106)
- [Housekeeping](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362678066171965)
- [Workshops](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362704528027810)
- [Team Creation Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362730939568248)
- [Project Submission Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362760920449095)
- [Judging Details](https://discord.com/channels/1179492116334919710/1179497189765038191/1190362788745445436)",
"color": 62441,
"thumbnail": {
  "url": "https://hacked.compeclub.com/static/media/HackedCircle.609e5186df6e9e190993.png"
}
}